[
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 1,
        "target_sid": null,
        "source_text": "In this paper the author aims at to outline how such family of formalisms can be defined, and show that like CFG's, each member possesses a number of desirable linguistic and computational properties: in particular, the constant growth property and polynomial recognisability.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 2,
        "target_sid": null,
        "source_text": "In considering the relationship between formalisms, the author shows that it is useful to abstract away from the details of the formalism, and examine the nature of their derivation process as reflected by properties of their derivation trees.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 3,
        "target_sid": null,
        "source_text": "Little attention has been paid to the structural descriptions that these formalisms can assign to strings, i.e.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 4,
        "target_sid": null,
        "source_text": "their strong generative capacity.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 5,
        "target_sid": null,
        "source_text": "This aspect of the formalism is both linguistically and computationally important.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 6,
        "target_sid": null,
        "source_text": "We consider properties of the tree sets generated by CFG's, Tree Adjoining Grammars (TAG's), Head Grammars (HG's), Categorial Grammars (CG's), and IG's.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 7,
        "target_sid": null,
        "source_text": "They examine both the complexity of the paths of trees in the tree sets, and the kinds of dependencies that the formalisms can impose between paths.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 8,
        "target_sid": null,
        "source_text": "These two properties of the tree sets are not only linguistically relevant, but also have computational importance.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 9,
        "target_sid": null,
        "source_text": "LCFRS's have only been loosely defined in this paper; they have to provide a complete set of formal properties associated with members of this class.",
        "strategy": null
    },
    {
        "summary_id": "P87-1015_sweta",
        "paper_id": "P87-1015",
        "source_sid": 10,
        "target_sid": null,
        "source_text": "The authors’ goal has been to use the notion of LCFRS's to classify grammatical systems on the basis of the strong generative capacity.",
        "strategy": null
    }
]